api/modules/v1/models/LoginForm.php

UPDATE "user" SET "updated_at"=1661322823, "access_token"='IsC8CbzZIUD1yfhg9PXvs_D8zjD5khLY' WHERE "id"=1
---
    public function login()
    {
        $user = $this->getUser();
        if ($this->validate()) {
            $token = Yii::$app->security->generateRandomString();
            $user->access_token = $token;

            return $user->save() ? $token : null;