api/modules/v1/models/Statament.php

    public function fields()
    {
        return [
            'id',
            'name',
            'family_name',
            'address',
            'country_of_origin',
            'email_address',
            'phone_number',
            'age',
            'hired' => function () {
                $status = [0 => 'yangi', 1 => 'intervyu belgilangan', 2 => 'qanul qilingan', 3 => 'qabul qilinmagan'];
                return $status[$this->hired];
            },
            'interview' => function () {
                $item = $this->getInterview()->one();
---
SELECT * FROM "interview" WHERE "statament_id"=3