common/models/User.php

SELECT * FROM "user" WHERE ("access_token"='IsC8CbzZIUD1yfhg9PXvs_D8zjD5khLY') AND ("status"=20)
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['access_token' => $token, 'status' => self::STATUS_ADMIN]);

SELECT * FROM "user" WHERE (("username"='morgan') AND ("status"=10)) OR (("username"='morgan') AND ("status"=20))
---
    public static function findByUsername($username)
    {
        return static::find()->where(['username' => $username, 'status' => self::STATUS_ACTIVE])->orWhere(['username' => $username, 'status' => self::STATUS_ADMIN])->one();