api/modules/v1/CreateAction.php

    private function createInterview($id) {
        $model = new $this->interviewClass([
            'scenario' => $this->scenario,
        ]);
        $model->statament_id = $id;
        $model->load(Yii::$app->getRequest()->getBodyParams(), '');
---
SELECT EXISTS(SELECT * FROM "interview" WHERE "interview"."statament_id"='1')